Repository: OmegaT-L10N/es
Catalog: tm/Gnome localization/en-es.tmx
Source language: en
Languages: es

source: We override the init method with some UI building, and connecting a callback to a signal for the button. We use the alignment container to allow the button to be centered in the plugin tab, and not monstrously take up the entire plugin space. Notice that the plugin_area instance variable contains a gtk.Frame that could be populated with all the plugin's widgets.
es: Se sobreescribirá el método «init» con una construcción de IU y conectando el retorno de la llamada a una señal para el botón. Se usará el contenedor de alineamiento para permitir que el botón esté centrado en la pestaña del complemento, y que no ocupe monstruosamente todo el espacio disponible. Note que la variable de instancia plugin_area gontiene un gtk.Frame que se puede llenar con todos los widgets del complemento.

source: def init(self): alignment = gtk.Alignment(0.5,0.5,0,0) self.click_button = gtk.Button('Click me!') alignment.add(self.click_button) self.plugin_area.add(alignment) self.click_button.connect('clicked', self.onClick) self.show_all()
es: def init(self): alignment = gtk.Alignment(0.5,0.5,0,0) self.click_button = gtk.Button('Púlseme') alignment.add(self.click_button) self.plugin_area.add(alignment) self.click_button.connect('clicked', self.onClick) self.show_all()

source: We also created a convenience method that returns a list of supported actions of the currently selected accessible item - if it does not support the Action interface, it returns an empty list:
es: También se ha creado un método de conveniencia que devuelve una lista de las acciones soportadas por el elemento accesible actualmente seleccionado; si no soporta la acción de la interfaz, entonces devuelve una lista vacía:

source: The base plugin class has a method call onAccChanged that is called everytime the target application's selected accessible item changes. We will override it setting the button to be sensitive only when the current accessible item has the "click" action:
es: Esta clase de complemento base tiene una llamada de método onAccChanged a la que se llama cada vez que el elemento accesible seleccionado de la aplicación objetivo cambia. Se sobreescribirá ajustando el botón para ser sensible sólo cuando el elemento accesible actual tiene la acción «click».

source: The callback method for button "clicked" performs the "click" action on the accessible item. Since this callback could only be called when the button is sensitive, we don't need to worry about checking if the current accessible has the "click" action?
es: El método del retorno de llamada para el botón pulsado realiza la acción de pulsación en el elemento accesible. Ya que a este retorno de llamada sólo se le puede llamar cuando el botón es sensible, no se debe preocupar acerca de comprobar si el accesible actual tiene la acción «cick».

source: 2. How to install and run Accerciser
es: 2. Cómo instalar y configurar Accerciser

source: Setting up Accerciser
es: Configurar Accerciser

source: Installing and running Accerciser on your system
es: Instalar y ejecutar Accerciser en su sistema

source: Check if your distribution has Accerciser already packaged. If this is the case, you can install it via its package manager. Otherwise, you can follow the section below to install Accerciser manually.
es: Compruebe si su distribución tiene Accerciser ya empaquetado. En este caso, puede instalarlo mediante su gestor de paquetes. Si no, puede leer la siguiente sección para instalar Accerciser manualmente.

source: Installing Accerciser manually
es: Instalar Accerciser manualmente

source: To install Accerciser manually, you will need to download it first. Accerciser's source code can either be downloaded from the gnome.org FTP site or cloned from the gnome.org GIT repository.
es: Para instalar Accerciser manualmente, primero deberá descargarlo. El código fuente de Accerciser se puede descargar desde el sitio FTP de gnome.org o clonarse desde el repositorio GIT de gnome.org.

source: If you are not using GNOME 3, you may find that Accerciser version 3 or later is not compatible with your environment.
es: Si no usa GNOME 3, puede pasar que la versión 3 o superior de Accerciser no es compatible con su entorno.

source: After getting Accerciser, install it using the following commands:
es: Después de obtener Accerciser instálelo usando los siguientes comandos:

source: ./autogen.sh # or ./configure for first time installation
es: «./autogen.sh #» o «./configure» para la instalación inicial

source: sudo make install # or make install as root
es: «sudo make install #» o «make install» como root

source: If you find any problems installing Accerciser on your system, it is likely that some of its dependencies are missing. Check Accerciser's wiki to make sure you have all dependencies properly installed.
es: Si tiene problemas al instalar Accerciser en su sistema, es posible que falte alguna de sus dependencias. Compruebe el wiki de Accerciser para asegurarse de que tiene todas las dependencias instaladas correctamente.

source: Running Accerciser
es: Ejecutar Accerciser

source: To start Accerciser, type accerciser in a terminal window or within the Run dialog and then press Return.
es: Para iniciar Accerciser, escriba accerciser en una ventana de la terminal o en el diálogo «Ejecutar» y pulse Intro.

source: After that, you can use Accerciser to inspect any accessible item shown in the Application Tree View's hierarchy. Select an item and investigate it using one of Accerciser's plugins.
es: Después de esto puede usar Accerciser para inspeccionar un elemento accesible mostrado en la jerarquía de la vista en árbol de la aplicación.. Seleccione un elemento e investíguelo usando uno de los complementos de Accerciser.

source: 4. Event Monitor Plugin
es: 4. Complemento Monitor de eventos

source: Monitoring accessible events as they occur
es: Monitorizar eventos accesibles cuando ocurren

source: Event Monitor Plugin
es: Complemento Monitor de eventos

source: The Event Monitor Plugin allows you to view AT-SPI events as they occur on the applications exposed in Accerciser's Application Tree View. The plugin is useful to explore the dynamics of an application's interface and verify which accessible widgets are related to which AT-SPI events.
es: El complemento «Monitor de eventos» le permite ver los eventos AT-SPI a medida que suceden en la aplicación expuesta en la vista en árbol de la aplicación de Accerciser. El complemento es útil para explorar la dinámica de la interfaz de una aplicación y verificar qué widgets accesibles están relacionados con eventos de AT-SPI.

source: The Event Monitor Plugin allows you to view AT-SPI events and match them with accessible widgets.
es: El complemento Monitor de eventos le permite ver los eventos AT-SPI y asociarlos con widgets accesibles.

source: Running the Event Monitor Plugin
es: Ejecutar el complemento Monitor de eventos

source: When you open the Event Monitor Plugin, you see a list of checkboxes representing all the different AT-SPI event classes covered by the plugin:
es: Cuando abre el complemento del Monitor de eventos, verá una lista de casillas de verificación representando todas las clases diferentes de AT-SPI que el complemento cubre:

source: document
es: documento

source: focus
es: foco

source: mouse
es: ratón

source: object
es: objeto

source: window
es: ventana

source: If you check a class, all of its event types will be monitored by the plugin. The classes are exposed as tree structures; therefore, you can refine your selection by expanding them and checking only the event types you really care about.
es: Si selecciona una clase, el complemento monitorizará todos sus tipos de eventos. Las clases se exponen como estructuras en árbol; por ello, puede refinar su selección expandiéndolas y seleccionando solo los tipos de eventos que realmente le importan.

source: If you want to monitor all possible types of AT-SPI events, press the Select All button. Similarly, if you want to clear all currently selected event types, press the Clear Selection button.
es: Si quiere monitorizar todos los tipos posibles de eventos AT-SPI, pulse el botón Seleccionar todos. De forma similar, si quiere limpiar todos los tipos de eventos actualmente seleccionados, pulse el botón Limpiar selección.

source: Selecting only a few event types per monitoring gives you a clearer output.
es: Seleccionar sólo unos pocos tipos de eventos para monitorizar proporciona una salida más limpia.

source: Another way to refine event monitoring is by the event source. By default, the Source option Everything is selected, indicating that AT-SPI events of all applications will be monitored. If you want to investigate a single application, select it in the Application Tree View and click the Source radio button Selected application. Likewise, if you want to monitor a single accessible widget and its corresponding descendants, select it in the Application Tree View and click the Source radio button Selected accessible.
es: Otra forma de refinar la monitorización de eventos es a través del origen del evento. De forma predeterminada la opción Todo, como fuente, está seleccionada, indicando que se monitorizarán todos los eventos AT-SPI de todas las aplicaciones. Si quiere investigar una sola aplicación, selecciónela en la vista de árbol de la aplicación y pulse en el botón de radio Fuente Aplicación seleccionada. De la misma forma, si quiere monitorizar un solo widget accesible y sus correspondientes descendientes, selecciónelo en la vista de árbol de la aplicación y pulse en el botón de radio Fuente Accesible seleccionado.

source: After selecting event types and specifying a Source option, the Event Monitor Plugin starts monitoring AT-SPI events automatically, because the Monitor Events button is pressed by default. Whenever you want to stop monitoring, click the Monitor Events button. To restart monitoring, press this button again.
es: Después de seleccionar los tipos de evento y especificar una opción para la fuente, el complemento de monitorización de eventos comienza automáticamente a monitorizar los eventos AT-SPI, ya que el botón Monitorizar eventos está pulsado de forma predeterminada. Cuando quiera dejar de monitorizar eventos, pulse el botón Monitorizar eventos. Pulse el botón de nuevo para reiniciar la monitorización.

source: For each incoming event, the Event Monitor Plugin indicates the source and the application. Activating the link for either of these items will cause it to become selected in the Application Tree View.
es: Para cada evento entrante, el complemento del Monitor de eventos indica la fuente y la aplicación. Activar el enlace para alguno de esos elementos hará que se seleccione en la vista en árbol de la aplicación.

source: If you want to save the output generated by the Event Monitor Plugin, just press the Save button. To clear the output screen, you just need to click the Clear button.
es: Si quiere guardar la salida generada por el complemento de Monitor de eventos, simplemente pulse el botón Guardar. Para limpiar la salida de la pantalla, simplemente pulse el botón Limpiar.

source: 1. Application Tree View
es: 1. Vista en árbol de la aplicación

source: Exploring the accessible hierarchy of the desktop
es: Explorar la jerarquía accesible del escritorio

source: Application Tree View
es: Vista en árbol de la aplicación

source: Accerciser's interface contains a tree view, namely Application Tree View, that covers all accessible applications currently running on the desktop. To create this tree view, Accerciser uses the AT-SPI's registry daemon. This daemon is responsible for keeping track of all the accessible applications on the desktop and forwarding X events over the AT-SPI D-Bus. After getting all accessible applications, Accerciser represents each one of them as a hierarchical structure with expanding nodes.
es: La interfaz de Accerciser contiene una vista de árbol llamada vista de árbol de la aplicación, que cubre todas las aplicaciones accesibles actualmente en ejecución en el escritorio. Para crear esta vista de árbol Accerciser usa el demonio de registro de AT-SPI. Este demonio es el responsable de mantener el seguimiento de todas las aplicaciones accesibles en el escritorio y reenviar los eventos X sobre el D-Bus de AT-SPI. Después de obtener todas las aplicaciones accesibles, Accerciser representa cada una de ellas en una estructura jerárquica con nodos expandidos.

source: Accerciser's Application Tree View represents the interface of each accessible application running on the desktop as a widget hierarchical structure.
es: La vista en árbol de la aplicación de Accerciser representa la interfaz de cada aplicación accesible en ejecución en el escritorio como una estructura jerárquica de widget.

source: The first node of each application represented in this tree view is the application itself. When you expand a node, you can see all of its child widgets, which allows a hierarchical view of the application's interface. For each node, Accerciser provides some basic information, such as its name, role and number of children.
es: El primer nodo de cada aplicación representada en esta vista de árbol es la aplicación en sí. Cuando expande un nodo puede ver todos sus widgets hijos, lo que permite una vista jerárquica de la interfaz de la aplicación. Para cada nodo, Accerciser proporciona alguna información básica, tal como su nombre, rol y número de hijos.

source: Be aware that nodes with many children take a long time to expand.
es: Tenga en cuenta que los nodos con muchos hijos puede tardar en expandirse.

source: Bookmarking items in the Application Tree View
es: Marcar elementos en la vista en árbol de la aplicación

source: Accerciser allows bookmarking items in the Application Tree View for later examining. This is helpful when the target application must be restarted - after rebuilding it, for example. To bookmark an item, select it and do BookmarksAdd Bookmark or press Ctrl+d.
es: Accerciser permite marcar elementos en la vista en árbol de la aplicación, para examinarlos posteriormente. Esto puede ser útil si la aplicación objetivo debe reiniciarse, por ejemplo, después de reconstruirla. Para marcar un elemento, selecciónelo y pulse MarcadoresAñadir marcador o pulse Ctrl+d.

source: Bookmarks to accessible items in Accerciser are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state - i.e. multiple top level frames -, the path might not be correct. Bookmarks could be managed by accessing the bookmark editing dialog through BookmarksEdit Bookmarks.
es: Los marcadores a accesibles en Accerciser están definidos por el nombre de la aplicación y una «ruta» en la jerarquía interna del accesible de la aplicación al accesible marcado. Cuando la aplicación objetivo está en un estado diferente (ej. múltiples marcos de nivel superior) puede que la ruta no sea correcta. Se pueden gestionar los marcadores accediendo al diálogo de edición de marcadores a través de MarcadoresEditar marcadores.

source: 1. API Browser Plugin
es: 1. Complemento Examinador API

source: Verifying interfaces, methods, and properties
es: Verificar interfaces, métodos y propiedades

source: API Browser Plugin
es: Complemento Examinador API

source: Given an accessible widget selected in the Application Tree View, the API Browser Plugin shows its implemented AT-SPI interfaces along with its methods and properties.
es: Dado un «widget» accesible seleccionado en la vista en árbol de la aplicación, el complemento Examinador API muestra sus interfaces AT-SPI implementadas, junto con sus métodos y propiedades.

source: The API Browser Plugin allows you to verify interfaces, methods, and properties of a target accessible widget in an application.
es: El complemento Examinador API le permite verificar interfaces, métodos y propiedades soportados por el widget accesible objetivo en la aplicación.

source: Running the API Browser Plugin
es: Ejecutar el complemento Examinador API

source: To run the API Browser Plugin, select an accessible widget in the Application Tree View. Double-clicking a widget highlights it in the application's interface, so you can be sure whether a certain widget were the one you were looking for.
es: Para ejecutar el complemento Examinador API, seleccione un «widget» accesible en la Vista en árbol de la aplicación. Pulsar dos veces sobre un «widget» lo resalta en la interfaz de la aplicación, de tar forma que puede estar seguro del «widget» que está buscando.

source: After that, select one of the widget's interfaces in the combobox. All public methods of the selected interface will be listed in the plugin's leftmost column. All public properties, with their corresponding values, will be listed in the plugin's rightmost column.
es: Después de ello, seleccione una de las interfaces del «widget» en la caja combinada. Se listarán, en la columna de la izquierda del complemento, todos los métodos públicos de la interfaz seleccionada. Se listarán, en la columna de la derecha del complemento, todas las propiedades públicas, con sus correspondientes valores.

source: By default, the API Browser Plugin hides private methods and properties. To see them listed, unselect the checkbox Hide Private Attributes. To hide them again, re-select this checkbox.
es: De manera predeterminada, el complemento «Examinador API» oculta los métodos y las propiedades privadas. Para listarlos, desmarque la casilla Ocultar los atributos privados. Para volver a ocultarlos, selecciona esta casilla de nuevo.

source: _Hide/Show Applications without children
es: _Ocultar/Mostrar aplicaciones sin hijos

source: external ref='figures/api_browser.png' md5='47cae67d29c708139b9740d06fd2521e'
es: external ref='figures/api_browser.png' md5='47cae67d29c708139b9740d06fd2521e'sort

source: external ref='figures/tree_view_accerciser.png' md5='08296541e21b96951e1f1b4d99ca130b'
es: external ref='figures/tree_view_accerciser.png' md5='08296541e21b96951e1f1b4d99ca130b'sort

source: external ref='figures/event_monitor_plugin.png' md5='1ee2a1d281deefa5b401244b49ed9654'
es: external ref='figures/event_monitor_plugin.png' md5='1ee2a1d281deefa5b401244b49ed9654'sort

source: external ref='figures/accerciser-logo.png' md5='ccb260de40944187394405ae163757cf'
es: external ref='figures/accerciser-logo.png' md5='ccb260de40944187394405ae163757cf'text

source: Accerciser
es: Accerciserlink

source: Accerciser's logo Accerciser
es: Logo de Accerciser Accerciser

source: external ref='figures/interface_viewer_plugin.png' md5='c83c4113369ff2adc756dfd8614a48ed'
es: external ref='figures/interface_viewer_plugin.png' md5='c83c4113369ff2adc756dfd8614a48ed'sort

source: external ref='figures/accerciser-view.png' md5='fe4edcab1458ebe903cc46878c53ee64'
es: external ref='figures/accerciser-view.png' md5='fe4edcab1458ebe903cc46878c53ee64'sort

source: external ref='figures/IPython_plugin.png' md5='4e25a8b12536302b54f4ea31e2d142c9'
es: external ref='figures/IPython_plugin.png' md5='4e25a8b12536302b54f4ea31e2d142c9'sort

source: accessibility;development;test;
es: accesibilidad;desarrollo;pruebas;

source: (Editable)
es: (Editable)Start

source: Start: %d
es: Inicio: %dEnd

source: End: %d
es: Final: %d

source: def onClick(self, button): ai = self.node.acc.queryAction() action_names = [ai.getName(i) for i in xrange(ai.nActions)] ai.doAction(action_names.index('click'))
es: def onClick(self, button): ai = self.node.acc.queryAction() action_names = [ai.getName(i) for i in xrange(ai.nActions)] ai.doAction(action_names.index('click')) text

source: Accerciser's logo
es: Logo de Accerciser

source: Make sure that accessibility support is enabled in your desktop - otherwise, Accerciser will not work as expected.
es: Asegúrese de que el soporte de accesibilidad está activado en su escritorio; si no lo está, Accerciser no funcionará como se espera.

source: Change your own user data
es: Cambie sus propios datos de usuario

source: Authentication is required to change your own user data
es: Para cambiar sus datos de usuario debe autenticarse

source: Manage user accounts
es: Gestione cuentas de usuario

source: Authentication is required to change user data
es: Para cambiar datos de usuario debe autenticarse

source: Change the login screen configuration
es: Cambie la configuración de pantalla de acceso

source: Authentication is required to change the login screen configuration
es: Para cambiar la configuración de la pantalla de acceso debe autenticarse

source: Output version information and exit
es: Mostrar información de versión y salir

source: Replace existing instance
es: Reemplazar la instancia actual

source: Enable debugging code
es: Activar código de depuración

source: Provides D-Bus interfaces for querying and manipulating user account information.
es: Proporciona interfaces DBus para consultar y manipular cuentas de usuario

source: Default GNOME Theme
es: Tema predeterminado de GNOME

source: OK
es: Aprobado

source: Art
es: Arte

source: Camera
es: Cámara

source: Certified
es: Certificado

source: Cool
es: Divertido

source: Danger
es: Peligro

source: Distinguished
es: Distinguido

source: Draft
es: Borrador

source: Handshake
es: Acuerdo

source: Marketing
es: Mercadotecnia

source: Money
es: Dinero

source: Note
es: Nota

source: People
es: Gente

source: Pictures
es: Fotografías

source: Plan
es: Planificación

source: Presentation
es: Presentación

source: Sales
es: Ventas

source: Trash
es: Papelera

source: Downloads
es: Descargas

source: Favorite
es: Favorito

source: Generic
es: Genérico

source: Important
es: Importante

source: Mail
es: Correo

source: New
es: Nuevo

source: Package
es: Paquete

source: Photos
es: Fotos

source: No write
es: No escrito

source: No read
es: No leído

source: Urgent
es: Urgente

source: The Only One
es: El único

source: Documents
es: Documentos

source: _Select
es: _Seleccionarslot type

source: You are searching for a %s.
es: Está buscando un %s.

source: Select the game type to play
es: Seleccione el tipo de juego que desea jugar

source: Time
es: Tiempo

source: Statistics
es: Estadísticas%Id%d

source: Display cards with “%s” card theme
es: Mostrar las cartas con el tema «%s»%I6d", else to "%6dscore

source: You should have received a copy of the GNU General Public License along with %s; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA
es: Debería haber recibido una copia de la Licencia Pública General GNU junto con %s; si no, escriba a la Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 EE. UU.

source: You should have received a copy of the GNU General Public License along with this program. If not, see .
es: Debería haber recibido una copia de la Licencia Pública General GNU junto con este programa. De lo contrario, visite .

source: File is not a valid .desktop file
es: El archivo no es un archivo .desktop válido

source: Unrecognized desktop file Version '%s'
es: No se reconoce la versión «%s» del archivo desktop

source: Starting %s
es: Iniciando %s

source: Application does not accept documents on command line
es: La aplicación no acepta documentos en la línea de comandos

source: Unrecognized launch option: %d
es: Opción de lanzamiento no reconocida: %d

source: Can't pass document URIs to a 'Type=Link' desktop entry
es: No se pueden pasar los URI de documentos a entradas de escritorio «Type=Link»

source: Not a launchable item
es: No es un elemento lanzable

source: Disable connection to session manager
es: Desactivar conexión con el gestor de sesión

source: Specify file containing saved configuration
es: Especificar el archivo que contiene la configuración guardada
